Repository: ConradArq/NotificationService
Catalog: NotificationService.Shared/Resources/ValidationMessages.*.resx
Languages: es

# InvalidIntegerError
source: The value must be a valid integer.
es: El valor debe ser un número entero válido.

# InvalidDecimalError
source: The value must be a valid decimal number.
es: El valor debe ser un número decimal válido.

# InvalidDateError
source: The value must be a valid date in the format yyyy-MM-dd.
es: El valor debe ser una fecha válida en el formato yyyy-MM-dd.

# InvalidIntegerListError
source: The value must be a comma-separated list of integers.
es: El valor debe ser una lista de números enteros separados por comas.

# RequiredFieldError
source: The field is required and cannot be empty.
es: El campo es obligatorio y no puede estar vacío.

# InvalidFieldError
source: The field is not valid.
es: El campo no es válido.

# FieldMaxLengthError
source: The field cannot exceed {0} characters.
es: El campo no puede superar los {0} caracteres.

# FieldMustBeGreaterThanZeroError
source: The field must be greater than 0.
es: El campo debe ser mayor que 0.

# FieldRangeError
source: The field must be a value between {0} and {1}.
es: El campo debe ser un valor entre {0} y {1}.

# InvalidEmailError
source: The value must be a valid email address.
es: El valor debe ser una dirección de correo electrónico válida.

# RequiredPushNotificationRecipientError
source: At least one recipient must be provided: UserId or RoleId.
es: Se debe proporcionar al menos un destinatario: UserId o RoleId.

# InvalidEmailListError
source: The following email addresses are invalid: {0}
es: Las siguientes direcciones de correo electrónico no son válidas: {0}

# InvalidEmailTemplateError
source: If the subject or body is not provided, the template ID must be provided.
es: Si no se proporciona el asunto o el cuerpo, se debe proporcionar el ID de la plantilla.

# InvalidEnumError
source: The value must be a valid {0}. Valid values are: {1}.
es: El valor debe ser un {0} válido. Los valores válidos son: {1}.

# RequiredEmailNotificationRecipientError
source: At least one recipient must be provided: UserId, RoleId, or To.
es: Se debe proporcionar al menos un destinatario: UserId, RoleId o To.

# InvalidJsonFormat
source: Invalid JSON format. Original Message: {0}
es: Formato JSON no válido. Mensaje original: {0}

# EmptyRequestBody
source: Request body cannot be empty.
es: El cuerpo de la solicitud no puede estar vacío.

# InvalidJsonPropertyFormat
source: Invalid JSON property format. Original Message: {0}
es: Formato de propiedad JSON no válido. Mensaje original: {0}

# InvalidFormFieldFormat
source: Invalid form field format. Original Message: {0}
es: Formato de campo de formulario inválido. Mensaje original: {0}.

# InvalidQueryParameter
source: The query parameter '{0}' is not a valid value for the type '{1}'.
es: El parámetro de consulta '{0}' no es un valor válido para el tipo '{1}'.

# InvalidRouteParameter
source: The route parameter '{0}' is not a valid value for the type '{1}'.
es: El parámetro de ruta '{0}' no es un valor válido para el tipo '{1}'.

# ModelBindingError
source: Unable to bind model for the given input.
es: No se pudo vincular el modelo con los datos proporcionados.
